{
  "productName"    : "Immersive VR for Geospatial Visualization",
  "projectType"    : " A Spatial Data Explorer for Meta Quest",
  "type"           : "XR Case Study",
  "timeline"       : "Jan 2025 – Apr 2025",
  "tags"            : [
    "Virtual Reality",
    "Meta Quest",
    "Data Visualization",
    "Urban Planning"
  ],
  "featured"       : true,
  "metadata"       : {
    "title"      : "Immersive VR for Geospatial Visualization",
    "description": "A VR tool designed to help urban planners and analysts explore geospatial data layers in 3D using the Meta Quest headset.",
    "keywords"   : [
      "VR Interface Design",
      "Geospatial Data",
      "ArcGIS",
      "3D Interaction",
      "Data Visualization",
      "Immersive Technology",
      "Meta Quest"
    ],
    "imageUrl"   : "/images/shared/vr-visualization-preview.webp",
    "url"        : "https://sergei-borja.dev/vr-data-visualization"
  },
  "heroImage"      : "vr-visualization-preview-wide_xyswfp",
  "heroImageTablet": "vr-visualization-preview-square_ksjnll",
  "theme"          : {
    "themeColor"     : "#18469a",
    "lightThemeColor": "#8ca3cd",
    "darkThemeColor" : "#0c234d"
  },
  "projectSummary" : {
    "description": "A VR application for Meta Quest that lets urban planners and analysts explore layered geospatial data in 3D with hand-based controls, interactive UI, and real-world datasets.",
    "role": "As the Lead UX & Interaction Designer and VR Developer for this project, I played the main role in developing the user interface. I also implemented the Unity prototype with hand-based interactions and integrated the ArcGIS Maps SDK to ensure smooth transition between scenes.",
    "details"    : [
      {
        "header": "Course Name",
        "text"  : "CMPT 496: Final Project"
      },
      {
        "header": "Timeline",
        "text"  : "Jan 2025 – Apr 2025"
      },
      {
        "header": "Collaborator",
        "text"  : [
          "Keegan Vanstone"
        ]
      },
      {
        "header": "Skills",
        "text"  : [
          "UX Research & Testing",
          "Interaction Design for VR",
          "Visual Design",
          "VR Development",
          "Unity Scripting"
        ]
      },
      {
        "header": "Tech Stack",
        "text"  : [
          "C#",
          "Unity",
          "Unity DevOps",
          "Meta XR Interaction Toolkit",
          "ArcGIS Maps SDK for Unity",
          "Figma"
        ]
      }
    ]
  },
  "sections"       : [
    {
      "title"      : "The Problem Space",
      "icon"       : "problem",
      "contents"   : [
        {
          "type": "text",
          "text": "Working with geospatial data often involves parsing complex, layered information all within tools designed primarily for 2D or 3D viewing. These tools are powerful but can be dense, cognitively demanding, and require several other tools for a simple task. For professionals like urban planners or analysts, making sense of spatial relationships across disconnected maps and dashboards isn’t just inefficient and it can obscure critical insights. This environment presents unique challenges for clarity, context, and communication."
        }
      ],
      "subsections": [
        {
          "title"   : "Challenges",
          "contents": [
            {
              "type" : "list",
              "items": [
                {
                  "header": "2D views limit spatial understanding",
                  "text"  : "Traditional map and dashboard tools force users to interpret complex geospatial data on flat screens, limiting depth perception and spatial reasoning."
                },
                {
                  "header": "Multiple tools required for specific workflows",
                  "text"  : "Analysts frequently switch between multiple applications or browser tabs to access different data, leading to disjointed analysis."
                },
                {
                  "header": "Difficulty interpreting layers without context",
                  "text"  : "Whether zoning, demographics, or infrastructure, professionals like urban planners, data scientists, and policymakers benefit from viewing multi-layered geospatial information in a shared 3D context."
                },
                {
                  "header": "Underutilization of Immersive Technologies",
                  "text"  : "While 3D and VR technologies have been explored in other domains, a gap exists in applying immersive VR environments specifically to geospatial datasets."
                }
              ]
            }
          ]
        },
        {
          "title"   : "Problem Areas",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "problem-1_jopj7e",
                    "alt": "ArcGIS Enterprise web map showing red/green/blue night-lights trend rendering."
                  },
                  {
                    "src": "problem-2_ef2rhv",
                    "alt": "ArcGIS Pro 3D view of Wellington buildings colored by annual solar potential."
                  }
                ],
                "options": {
                }
              }
            }
          ]
        }
      ]
    },
    {
      "title"      : "The Solution",
      "icon"       : "solution",
      "contents"   : [
        {
          "type": "text",
          "text": "Rather than relying on static, screen-based tools, we introduced a fully immersive VR experience tailored for spatial data exploration. Built in Unity and optimized for the Meta Quest 3, our solution emphasizes intuitive interaction and deeper comprehension through:"
        },
        {
          "type" : "list",
          "items": [
            {
              "header": "Immersive 3D Environment with Natural Navigation",
              "text"  : "Our solution immerses users in interactive 3D environments with intuitive hand-based navigation, making spatial data exploration more natural and insightful."
            },
            {
              "header": "Interactive Layer Management",
              "text"  : "Users can toggle visibility, adjust opacity, and enable or disable specific data overlays through an accessible, in-world UI panel."
            },
            {
              "header": "Reduced Cognitive Load Through Immersive Exploration",
              "text"  : "By placing users directly inside a three-dimensional map, the system leverages kinesthetic and spatial learning strategies to make complex spatial relationships easier to understand."
            },
            {
              "header": "Integration with ArcGIS for Real-World Data Fidelity",
              "text"  : "The app uses the ArcGIS Maps SDK to bring in high-accuracy geographic data, enabling stakeholders to analyze real-world information in a realistic and interactive context."
            }
          ]
        }
      ],
      "subsections": [
        {
          "title": "Demo (Coming Soon)"
        }
      ]
    },
    {
      "title"      : "Research Process",
      "icon"       : "research",
      "contents"   : [
        {
          "type": "text",
          "text": "My teammate and I reviewed existing research and defined user needs through persona development to understand the existing issues with traditional spatial data viewing methods. This initial research helped clarify how traditional geospatial tools fall short, especially compared to more immersive technologies like VR."
        }
      ],
      "subsections": [
        {
          "title"   : "User Statement",
          "contents": [
            {
              "type"     : "userStatement",
              "statement": "As an urban planner, I want to intuitively explore layered geospatial data in a virtual environment to quickly understand spatial relationships and make informed planning decisions."
            }
          ]
        },
        {
          "title"   : "Personas",
          "contents": [
            {
              "type"   : "persona",
              "persona": {
                "name"      : "Maya Rodriguez",
                "image"     : "persona-vr_ebc5ek",
                "age"       : 35,
                "location"  : "Vancouver, BC",
                "devices"   : [
                  "Meta Quest 3"
                ],
                "type"      : "Municipal GIS Analyst",
                "quote"     : "I need to see how all the layers interact such as elevation, zoning, and infrastructure without flipping between ten different maps.",
                "goals"     : [
                  "Evaluate potential development zones with complete spatial context.",
                  "Compare zoning boundaries and building footprints in a single environment.",
                  "Communicate spatial insights clearly to non-technical stakeholders."
                ],
                "painPoints": [
                  "Wastes time toggling between flat maps and layers in disconnected tools.",
                  "Struggles to convey spatial relationships to decision-makers using 2D diagrams.",
                  "Finds it difficult to explain spatial decisions to team members without visual aids."
                ]
              }
            }
          ]
        }
      ]
    },
    {
      "title"      : "Ideation & Design",
      "icon"       : "design",
      "contents"   : [
        {
          "type": "text",
          "text": "Informed by our early research, technical constraints and problem definition, I led the ideation and interface design process, focusing on translating spatial data interactions into an intuitive, immersive VR experience. My work centred on creating a flow that would feel natural to both VR newcomers and experienced users."
        }
      ],
      "subsections": [
        {
          "title"   : "UI Flow",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "ui-flow_kyh1qq",
                    "alt": "UI Flow of VR geospatial app from launch, starting at the tutorial to data options and environment change."
                  }
                ],
                "options": {
                  "columns": 1
                }
              }
            }
          ]
        },
        {
          "title"   : "Idea Exploration",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "idea-2_bsvxd5",
                    "alt": "Hand-drawn sketches of VR data menu and 2D graph with list panel."
                  },
                  {
                    "src": "idea-1_vb5epr",
                    "alt": "Hand-drawn sketches of floating info screens and point-of-interest markers in 3D space."
                  }
                ],
                "options": {}
              }
            }
          ]
        },
        {
          "title"   : "Wireframing",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "wireframe-1_k7569z",
                    "alt": "Wireframe showing map selection list and layer opacity toggles."
                  },
                  {
                    "src": "wireframe-2_ankbz4",
                    "alt": "Wireframe legend panel listing data layers and color-coded symbols."
                  }
                ],
                "options": {}
              }
            }
          ]
        }
      ]
    },
    {
      "title"      : "Implementation",
      "icon"       : "implementation",
      "contents"   : [
        {
          "type": "text",
          "text": "To bring our concept to life, we transformed our early design into a functional VR prototype using Unity and the ArcGIS Maps SDK. While my teammate focused on implementing locomotion, SDK integration and deployment, I also designed and implemented the interactive UI and interaction, ensuring a smooth and immersive user experience."
        }
      ],
      "subsections": [
        {
          "title"   : "Development Process",
          "contents": [
            {
              "type" : "list",
              "items": [
                {
                  "header": "Interactive VR UI System",
                  "text"  : "I implemented the user interface, including toggles for data layer visibility, opacity sliders, and a toggleable legend panel. These tools allowed users to explore and manipulate geospatial data in real time."
                },
                {
                  "header": "Interaction Scripting",
                  "text"  : "I contributed to scripting behaviours such as data layer switching and legend updates. I also played a role in adapting inherited code to fit our new data visualization goals."
                },
                {
                  "header": "Scene-Based Data Exploration",
                  "text"  : "My teammate created the base environments using public datasets, while I ensured each city scene (Edmonton, Paris, Tokyo) supported seamless UI interaction and consistent user experience across locations."
                }
              ]
            }
          ]
        },
        {
          "title"   : "Legend Development",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "development_dmzjuy",
                    "alt": "VR scene in Unity with a floating legend panel anchored in the 3D environment."
                  }
                ],
                "options": {
                  "columns": 1
                }
              }
            }
          ]
        },
        {
          "title"   : "Challenges & Solutions",
          "contents": [
            {
              "type" : "list",
              "items": [
                {
                  "header": "ArcGIS Data Constraints",
                  "text"  : "The free ArcGIS account limited us to using publicly available tile and scene layers. Attempts to upload and use custom datasets failed due to hosting restrictions.\n\n|Solution:| We adapted by sourcing quality public datasets, especially for cities like New York and Tokyo, for our prototype."
                },
                {
                  "header": "UI Scripting & Layer Control",
                  "text"  : "Implementing runtime control of data layers via the UI required reverse-engineering some ArcGIS API code due to the lack of documentation.\n\n|Solution:| By analyzing the SDK scripts, we created custom functions to toggle visibility, adjust opacity, and switch data legends interactively."
                },
                {
                  "header": "Version Control Limitations",
                  "text"  : "Unity's large file sizes quickly exceeded GitHub's storage limits, complicating collaboration.\n\n|Solution:| Our solution was to adopt Unity DevOps, which better handled the project's larger files and allowed smooth collaboration."
                }
              ]
            }
          ]
        },
        {
          "title"   : "SDK Code Extracting",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "challenge-1_xfkg0u",
                    "alt": "Our C# code showing a loop that syncs a UI toggle’s state with a map layer’s visibility."
                  },
                  {
                    "src": "challenge-2_rkwslt",
                    "alt": "ArcGIS SDK C# example showing similar code, iterating through internal map layers to update visibility and opacity."
                  }
                ],
                "options": {}
              }
            }
          ]
        }
      ]
    },
    {
      "title"      : "Testing & Feedback",
      "icon"       : "testing",
      "contents"   : [
        {
          "type": "text",
          "text": "To evaluate the usability and effectiveness of our VR prototype, we designed and conducted a structured user testing session. We aimed to assess how easily participants could navigate and understand spatial data in VR and whether the interactive controls were intuitive for all users."
        }
      ],
      "subsections": [
        {
          "title"   : "Key Findings",
          "contents": [
            {
              "type"  : "quoteList",
              "quotes": [
                "The layer toggles and opacity controls were effective for exploring spatial data.",
                "Scene switching between cities was smooth and well-received.",
                "Request for continuous turning instead of snap-turning for smoother navigation.",
                "Ascend/descend controls were missing, limiting full vertical movement.",
                "Scene boundaries were unclear, and some users accidentally flew below the map."
              ]
            }
          ]
        }
      ]
    },
    {
      "title"      : "Final Prototype",
      "icon"       : "vr",
      "subsections": [
        {
          "title"   : "Scenes (Edmonton, Paris, Tokyo, Rendered Buildings)",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "final-edmonton_sln9ft",
                    "alt": "VR view of Edmonton’s 3D cityscape rendered in unrendered 3D blocks."
                  },
                  {
                    "src": "final-paris_gjiewv",
                    "alt": "VR view of Paris’s 3D cityscape rendered in unrendered 3D blocks."
                  },
                  {
                    "src": "final-tokyo_yfkhgn",
                    "alt": "VR view of Tokyo’s 3D cityscape rendered in unrendered 3D blocks."
                  },
                  {
                    "src": "final-tokyo-2_h7rbrj",
                    "alt": "VR view of Tokyo with detailed textured buildings."
                  }
                ],
                "options": {
                  "columns": 4
                }
              }
            }
          ]
        },
        {
          "title"   : "Data Layers",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "final-2_qitgbs",
                    "alt": "VR view of Edmonton with colored data layers under on the 3D model."
                  }
                ],
                "options": {
                  "columns": 1
                }
              }
            }
          ]
        },
        {
          "title"   : "UI Components",
          "contents": [
            {
              "type"         : "imagesGallery",
              "imagesGallery": {
                "images" : [
                  {
                    "src": "final-5_simhib",
                    "alt": "Floating VR UI showing map select buttons and sliders for layer opacity."
                  },
                  {
                    "src": "final-6_gkovak",
                    "alt": "VR legend panel listing data layers and their color-coded symbols."
                  }
                ],
                "options": {
                }
              }
            }
          ]
        }
      ]
    },
    {
      "title"   : "Reflection",
      "icon"    : "journal",
      "contents": [
        {
          "type": "text",
          "text": "While we couldn't implement the changes from our testing, we got an insight into how we can improve both our design and development skills for VR. By embracing both the creative and practical challenges of VR development, we delivered a functional prototype that pushed our skills and demonstrated the viability of spatial data exploration in virtual environments."
        },
        {
          "type" : "list",
          "items": [
            {
              "header": "Shifting focus early led to a stronger product direction",
              "text"  : "Pivoting from abstract datasets to geospatial data mid-project allowed us to ground the experience in real-world use cases and better align with user expectations for spatial understanding."
            },
            {
              "header": "Working within technical constraints taught resourceful problem-solving",
              "text"  : "Limitations from the ArcGIS SDK, Unity version control, and VR build compatibility forced us to explore alternate tools and workflows, building our confidence in navigating platform-specific challenges."
            },
            {
              "header": "Collaboration and clear task division accelerated progress",
              "text"  : "Splitting responsibilities between UI/UX design and development helped us iterate faster and maintain a steady development pace over the semester."
            }
          ]
        }
      ]
    }
  ]
}