{
  "productName"    : "The Elder Scrolls: Skyrim",
  "projectType"    : "Quest Log Redesign",
  "heroImage"      : "images/case-study/skyrim/skyrim-quest-log-preview.webp",
  "heroImageTablet": "images/case-study/skyrim/skyrim-quest-log-preview-tablet.webp",
  "heroImageMobile": "images/case-study/skyrim/skyrim-quest-log-preview-mobile.webp",
  "theme"          : "brown",
  "projectSummary" : {
    "description": "|Skyrim Quest Log Redesign| is a UX/UI project, a redesign to fix usability issues that frustrated players, such as poor organization, lack of clarity, and minimal accessibility. By turning the quest log into an interactive journal, we made it more immersive, intuitive, and personalized for different play styles.",
    "metadata"   : [
      {
        "header" : "Role",
        "content": "UX Researcher & Interaction Designer"
      },
      {
        "header" : "Skills",
        "content": [
          "User Research & Testing",
          "Interaction Design",
          "Prototyping",
          "Visual Design"
        ]
      },
      {
        "header" : "Timeline",
        "content": "Jan 2024 – Apr 2024"
      },
      {
        "header" : "Tools",
        "content": [
          "Adobe Illustrator",
          "Adobe Photoshop",
          "Google Forms",
          "Figma"
        ]
      },
      {
        "header" : "Course Name",
        "content": "DESN 342: DXD Theory & Issues"
      },
      {
        "header" : "Collaborators",
        "content": [
          "Chris Clarke",
          "Sankalp Shrivastav"
        ]
      }
    ]
  },
  "sections"       : [
    {
      "title"      : "Problem",
      "contents"   : [
        "The original Skyrim quest log presented several usability and design challenges that impacted the overall player experience.  While it served its basic function, many players found it difficult to navigate, lacking in clarity, and disruptive to immersion.\n\nSome of the issues player run into includes:",
        [
          {
            "header" : "Differentiate between main and side quests",
            "content": "Players struggle to identify which quests are essential to the main storyline and which are optional or side content. "
          },
          {
            "header" : "Find relevant quest information",
            "content": "Players often can't quickly locate the details they need within a quest such as objectives, location, status, or context."
          },
          {
            "header" : "Re-immerse after time away from the game",
            "content": "After taking a break from Skyrim, players find it difficult to recall what they were doing in their quests. The quest log does not support easy memory recall."
          }
        ]
      ],
      "images"     : [
        [
          {
            "image"              : "images/case-study/skyrim/quest-log-issue.webp",
            "containerPercentage": 75
          }
        ]
      ],
      "subsections": [
        {
          "title"   : "Our Solution",
          "contents": [
            "Building on our research findings, the final solution introduces a redesigned quest log with features that directly tackle the identified user pain points:",
            [
              {
                "header" : "Clear Quest Categorization",
                "content": "We introduced visual tags, filters, and color-coded labels to clearly separate main quests from side quests and miscellaneous tasks."
              },
              {
                "header" : "Enhanced Quest Information",
                "content": "Quests now feature structured objectives, contextual summaries, and sorting tools to help players quickly find and act on relevant information."
              },
              {
                "header" : "Immersion Through Memory Aids",
                "content": "A dedicated synopsis section allows players to easily revisit key quest details and story progress after time away from the game."
              }
            ]
          ],
          "images"  : [
            [
              {
                "image"              : "images/case-study/skyrim/mockup-1.webp",
                "containerPercentage": 75
              }
            ]
          ]
        }
      ]
    },
    {
      "title"      : "Research",
      "contents"   : [
        "We began by conducting a range of research methods including heuristic evaluations, competitor analysis, and player-focused techniques like user interviews, guided tours, and the 5 Whys method. These approaches helped us uncover patterns in player behaviour and gather actionable insights that informed our design direction."
      ],
      "subsections": [
        {
          "title"   : "User Research Findings",
          "contents": [
            "Through the research and user interviews we gained valuable insight about the pain points of the current interface. Some the insight we gain from the different research methods includes:",
            [
              {
                "header" : "Heuristic Evaluation",
                "content": "We found the original log lacked clear cues for active vs. completed quests and had cramped typography, making quick scanning difficult."
              },
              {
                "header" : "Competitive Analysis",
                "content": "Comparing other RPGs showed Skyrim’s log missed collapsible categories and filters, forcing players to scroll through lengthy lists."
              },
              {
                "header" : "User Interviews",
                "content": "Players expressed frustration over searching dozens of quests, with lore-heavy descriptions causing them to lose track of objectives."
              },
              {
                "header" : "Guided Tours",
                "content": "Watching players revealed they skimmed long text and ignored details, indicating a need for concise summaries in each entry."
              },
              {
                "header" : "5 Whys",
                "content": "Digging deeper showed that without hierarchy or filters, important objectives were buried under completed tasks, slowing progress."
              }
            ]
          ],
          "images"  : [
            [
              {
                "image"  : "images/case-study/skyrim/heuristic-4.webp",
                "caption": "Consistency and Standards. This layout demonstrates strong consistency, with clear quest descriptions and checklist-style objectives. However, not all quests follow this format, as miscellaneous ones lack detail, breaking this consistency."
              },
              {
                "image"  : "images/case-study/skyrim/heuristic-1.webp",
                "caption": "Match Between the System and the Real World. Real-world phrases like “looking for a woman in Whiterun” make the objective easier to follow for most players; however, fantasy-specific terms without context like “Redguard” or “Alik’r” can prevent players unfamiliar with Skyrim’s lore from fully understanding the quest."
              }
            ],
            [
              {
                "image"  : "images/case-study/skyrim/competitor-witcher-1.webp",
                "caption": "The Witcher 3’s quest log is divided into categories with icons and indicators for quest type, location, and completion. While visually organised, it can feel overwhelming due to dense text and lore-heavy descriptions."
              },
              {
                "image"  : "images/case-study/skyrim/competitor-metro.webp",
                "caption": "Metro Exodus uses an immersive in-world quest interface, where players interact with a physical map or journal, enhancing engagement and storytelling without breaking immersion."
              }
            ]
          ]
        },
        {
          "title"   : "Player Personas",
          "contents": [
            "Finally, we developed user personas representing distinct Skyrim player types to translate our research into actionable insights. These personas anchored our redesign strategy, ensuring our solutions prioritized usability, clarity, and immersive gameplay for various player needs."
          ],
          "persona" : {
            "name"      : "Hiroshi Nakamura",
            "image"     : "/images/case-study/skyrim/skyrim-persona.webp",
            "age"       : 32,
            "location"  : "Edmonton, Alberta",
            "devices"   : [
              "PC",
              "Xbox Series X",
              "PS5"
            ],
            "type"      : "Completionist",
            "quote"     : "I enjoy the satisfaction of completing everything a game has to offer.",
            "goals"     : [
              "Complete side quests before progressing main story",
              "Organize quest log based on personal playstyle",
              "Track progress and achievements"
            ],
            "painPoints": [
              "No way to sort or filter quests",
              "Can’t distinguish main vs. side quests",
              "Overly cluttered quest list"
            ]
          }
        }
      ]
    },
    {
      "title"      : "Design Development",
      "contents"   : [
        "With usability issues clearly defined, we moved into design development by transforming our insights into tangible solutions. Through a step-by-step process including ideation, visual exploration, and iterative refinement, we crafted an experience focused on immersion, clarity, and accessibility."
      ],
      "subsections": [
        {
          "title"   : "Ideation",
          "contents": [
            "We started with whiteboarding to explore layout ideas, then used storyboarding to map the player journey and pinpoint when features like synopses and filtering would be most useful.",
            [
              {
                "header" : "Whiteboarding",
                "content": "Sketching early layouts helped us prioritize features by effort and impact, revealing that sorting and summaries were high-value, low-effort improvements."
              },
              {
                "header" : "Storyboarding",
                "content": "Visualizing a player's journey highlighted how users lose context after breaks, reinforcing the need for a synopsis tab and clearer quest transitions."
              }
            ]
          ],
          "images"  : [
            [
              {
                "image"  : "images/case-study/skyrim/whiteboarding-1.webp",
                "caption": "This whiteboarding session captures an early-stage evaluation of quest log improvement ideas, ranked by effort and impact. Each sticky note represents a distinct feature or change. We first focused on idea generation."
              },
              {
                "image"  : "images/case-study/skyrim/storyboarding.webp",
                "caption": "This storyboard outlines a player's journey in Skyrim, from accepting a quest to returning after a break, highlighting how effective quest tracking can support clarity and help users reorient themselves."
              }
            ]
          ]
        },
        {
          "title"   : "UI Flow Improvements",
          "contents": [
            "Building on our storyboard, we mapped out improved UI flows that reduced friction and enabling faster switching between quests, summaries, and map views with minimal cognitive effort."
          ],
          "images"  : [
            [
              {
                "image"              : "images/case-study/skyrim/ui-flow-2.webp",
                "caption"            : "The revised flow introduces options for sorting, identifying active quests, and marking them for tracking. This supports better organization, personalization, and re-engagement after breaks, enhancing the overall usability of the quest log.",
                "containerPercentage": 60
              }
            ]
          ]
        },
        {
          "title"   : "Style Tile",
          "contents": [
            "Next, we explored visual direction through a style tile by blending Skyrim’s fantasy aesthetic with modern readability. Earthy tones, parchment textures, and handwritten fonts helped shape an immersive journal-like feel."
          ],
          "images"  : [
            [
              {
                "image"  : "images/case-study/skyrim/style-tile-1.webp",
                "caption": "The initial style tile showcases a clean and minimal interface using a limited grayscale palette and condensed typography. While it fits Skyrim’s Nordic theme, it lacks warmth and variation, which can reduce visual engagement and clarity."
              },
              {
                "image"  : "images/case-study/skyrim/style-tile-2.webp",
                "caption": "The redesigned style tile introduces a more immersive, parchment-inspired aesthetic with earthy tones and enhanced typography hierarchy. Additional icons and labels improve visual cues, supporting a more engaging and readable quest log design."
              }
            ]
          ]
        },
        {
          "title"   : "Low to High Fidelity",
          "contents": [
            "We then transitioned into wireframing, starting with low-fidelity sketches to organize content and layout. As fidelity increased, we introduced refined visual cues, clearer hierarchies, and immersive thematic elements to guide users naturally through the interface."
          ],
          "images"  : [
            [
              {
                "image"  : "images/case-study/skyrim/wireframe-1.webp",
                "caption": "This early wireframe focused on base layout and organization, helping us define how quests are grouped and displayed. A faded background icon was added to tie quests to their storyline and add visual interest visually."
              },
              {
                "image"  : "images/case-study/skyrim/wireframe-2.webp",
                "caption": "The “Synopsis” tab beside the quest reinforced the connection between narrative and objectives. This helped create a more cohesive and informative quest reading experience."
              }
            ],
            [
              {
                "image"  : "images/case-study/skyrim/wireframe-7.webp",
                "caption": "At this stage, side quest icons, level indicators and other indicators were added for better use efficiency. The quest background logo was shifted off-centre to prevent the text from being unreadable."
              },
              {
                "image"  : "images/case-study/skyrim/wireframe-8.webp",
                "caption": "This version continues to explore detailed quest narratives but highlights how lore-heavy terminology. It reinforced the need for a balance between immersion and usability."
              }
            ],
            [
              {
                "image"  : "images/case-study/skyrim/wireframe-10.webp",
                "caption": "This version focused on balancing functionality with a realistic book, adding to the immersiveness of the quest log. The visual structure was refined through icon integration and proper breathing space to maintain realism."
              },
              {
                "image"  : "images/case-study/skyrim/wireframe-11.webp",
                "caption": "This layout introduced a stylized, handwritten-inspired font to strengthen the immersive feel of the quest log. Paired with the book-like design, the typography choice reinforced the narrative tone and helped the interface feel more immersive."
              }
            ]
          ]
        }
      ]
    },
    {
      "title"   : "Final Mockups",
      "contents": [
        "Finally, through several revisions we reach a final mockup that balances immersion with functionality. This final stage focused on refining visual cohesion, reinforcing narrative context, and ensuring the interface seamlessly integrated into the game world."
      ],
      "images"  : [
        [
          {
            "image"  : "images/case-study/skyrim/mockup-4.webp",
            "caption": "Quests are sorted by level, clearly emphasizing progression. The visual structure and use of icons improve scannability and distinguish quest types at a glance."
          },
          {
            "image"  : "images/case-study/skyrim/mockup-8.webp",
            "caption": "Recently added quests surface in descending order, helping players track the newest additions quickly and cleanly."
          }
        ],
        [
          {
            "image"  : "images/case-study/skyrim/mockup-2.webp",
            "caption": "A full narrative version of the journal entry is shown here for completed quests, offering immersive storytelling while maintaining a clean visual hierarchy in the completed quest list."
          },
          {
            "image"  : "images/case-study/skyrim/mockup-3.webp",
            "caption": "This minimal view of an active quest keeps the focus on a quest the user is doing, presenting a stripped-down version for quick referencing of the objective and reward."
          }
        ],
        [
          {
            "image"  : "images/case-study/skyrim/mockup-10.webp",
            "caption": "This screen shows how quest objectives seamlessly transition into the map interface, displaying the quest's location with visual consistency. The card on the map reflects the journal's aesthetic, reinforcing immersion and clarity for players navigating the world."
          },
          {
            "image"  : "images/case-study/skyrim/mockup-11.webp",
            "caption": "This page acts as the progress tracker, letting players browse different questlines. The right side overviews gameplay stats like skills, progress, and accomplishments."
          }
        ]
      ]
    },
    {
      "title"      : "Usability Testing",
      "contents"   : [
        "To evaluate the usability of our redesign, we conducted task-based usability testing using a functional prototype. Participants completed tasks, and we recorded both Inuit metric scores and qualitative feedback to assess effectiveness, efficiency, and satisfaction.",
        [
          {
            "header" : "Find a Specific Quest",
            "content": "Users searched for a specified quest and identified its objectives, type, and description."
          },
          {
            "header" : "Review a Completed Quest",
            "content": "Users located a finished quest and used the synopsis to understand what happened."
          },
          {
            "header" : "Track a Quest on the Map",
            "content": "Users selected a quest and used the interactive map to find its in-game location."
          }
        ]
      ],
      "subsections": [
        {
          "title"   : "Results & Impact",
          "contents": [
            "Our redesigned quest log significantly improved the player experience in key areas:",
            [
              {
                "header" : "Task success rate",
                "content": "Users could locate and identify quest objectives with greater accuracy, showing strong alignment between the new layout and player expectations.",
                "bold"   : "95%"
              },
              {
                "header" : "Improved navigation efficiency",
                "content": "With filtering, sorting, and visual indicators, players spent significantly less time searching through the quest log and freeing up focus for gameplay and exploration.",
                "bold"   : "53%"
              },
              {
                "header" : "Increased re-engagement",
                "content": "The addition of the Quest Synopsis tab allowed players to quickly re-immerse after taking a break, reducing confusion and improving long-term session retention.",
                "bold"   : "88%"
              }
            ]
          ]
        }
      ]
    },
    {
      "title"   : "Reflection",
      "contents": [
        "Redesigning Skyrim’s quest log challenged us to merge immersion with usability. By centering our process around real player frustrations, we delivered a solution that felt both familiar and fresh.",
        [
          {
            "header" : "User Centered Design Works",
            "content": "Grounding every decision in player feedback ensured we tackled real usability issues rather than relying on assumptions."
          },
          {
            "header" : "Style and Function Can Coexist",
            "content": "We demonstrated that immersive, lore-rich visuals can be thoughtfully integrated without sacrificing clarity or accessibility."
          },
          {
            "header" : "Iteration Drives Improvement",
            "content": "Each round of testing and refinement uncovered new opportunities to enhance both the interface and the user experience."
          }
        ]
      ]
    }
  ]
}