{
  "productName"    : "Telus World of Science",
  "projectType"    : "Stamp Book",
  "heroImage"      : "images/case-study/telus/telus-world-of-science-preview.webp",
  "heroImageTablet": "images/case-study/telus/telus-world-of-science-preview-tablet.webp",
  "heroImageMobile": "images/case-study/telus/telus-world-of-science-preview-mobile.webp",
  "theme"          : "purple",
  "projectSummary" : {
    "description": "|Telus World of Science Edmonton Guide Book| is a UX/UI project to design a new mobile app that enhances the visitor experience. Built from scratch, the app features AR-assisted navigation, a digital map, and a gamified stamp system to promote self-guided exploration. The goal was to create an engaging, educational, and accessible tool for learners of all ages across the science centre.",
    "metadata"   : [
      {
        "header" : "Role",
        "content": "UX Researcher & Interaction Designer"
      },
      {
        "header" : "Skills",
        "content": [
          "User Research & Testing",
          "Interaction Design",
          "Prototyping",
          "Visual Design",
          "AR Integration",
          "3D Modelling"
        ]
      },
      {
        "header" : "Timeline",
        "content": "Sept 2024 - Oct 2024"
      },
      {
        "header" : "Tools",
        "content": [
          "Adobe Aero",
          "Adobe Illustrator",
          "Blender",
          "Figma"
        ]
      },
      {
        "header" : "Course Name",
        "content": "DESN 444: Interaction Design II"
      },
      {
        "header" : "Collaborators",
        "content": [
          "Stephanie Flordelis",
          "Rachel Nhan"
        ]
      }
    ]
  },
  "sections"       : [
    {
      "title"      : "Problem",
      "contents"   : [
        "At the Telus World of Science Edmonton, we identified two key areas impacting guest experience:",
        [
          {
            "header": "Accessibility Limitations"
          },
          {
            "header": "Ineffective Map System"
          },
          {
            "header": "Barriers to Hands-On Learning"
          },
          {
            "header": "Low Engagement with Exhibits"
          }
        ],
        "These were some of the issues we identified during our visit and they directly shaped the goals of this project. In order to improve the experience, we needed to design an application to solve some of issues."
      ],
      "subsections": [
        {
          "title"   : "Our Solution",
          "contents": [
            "To address the challenges we identified, we designed a mobile app that enhances both navigation and exploration at the science centre. Our solution integrates:",
            [
              {
                "header" : "AR-Assisted Navigation",
                "content": "Guests can scan location markers to receive real-time directional cues, making it easier to find exhibits and facilities."
              },
              {
                "header" : "Interactive Stamp Book",
                "content": "A gamified system encourages exploration by letting users collect digital stamps at each exhibit, adding purpose to their visit."
              },
              {
                "header" : "Highly Accessible",
                "content": "Visual prompts, audio support, and simplified language make the content more inclusive for diverse age groups and learning styles."
              }
            ]
          ],
          "images"  : [
            [
              {
                "image"  : "/images/case-study/telus/telus-solution.webp",
                "caption": "This image showcases the core features of the Telus World of Science app, including onboarding, a digital stamp book, an interactive exhibit directory, AR scanning for exploration, and a personalized user profile."
              }
            ]
          ]
        }
      ]
    },
    {
      "title"      : "Research",
      "contents"   : [
        "As a first step, we visited the Telus World of Science Edmonton to observe how guests moved through the space and engaged with exhibits. Some of the key aspect of the science center includes:",
        [
          {
            "header" : "Navigation",
            "content": "How guests orient themselves and move through the space. It involves understanding where you are, where you want to go, and how to get there."
          },
          {
            "header" : "Exploration",
            "content": "How guests engage with exhibits and absorb information. It’s about hands-on discovery, curiosity, and learning through interaction."
          }
        ]
      ],
      "subsections": [
        {
          "title"   : "Contextual Research",
          "contents": [
            "During our on-site visit to the Telus World of Science Edmonton, we documented various wayfinding and exhibit interactions through photos. The images highlight key spots for potential improvements in exploration or navigation in the space."
          ],
          "images"  : [
            [
              {
                "image"  : "/images/case-study/telus/navigation-1.webp",
                "caption": "A static floor map near the entrance offers an overview of exhibits but lacks interactive elements or directional arrows, making real-time navigation difficult for guests. The interactive map system they do use is poorly implemented and difficult to use."
              },
              {
                "image"  : "/images/case-study/telus/navigation-2.webp",
                "caption": "A directional sign listing exhibit names hangs above a ramp, but without arrows or location context, it provides limited guidance for visitors trying to find their way."
              }
            ],
            [
              {
                "image"  : "/images/case-study/telus/exploration-1.webp",
                "caption": "A quiz-style screen with static options presents cultural content but lacks audio, animation, or feedback which poses a challenge for younger or non-reading visitors."
              },
              {
                "image"  : "/images/case-study/telus/exploration-2.webp",
                "caption": "A projected interface displays interactive content, but the flat design and lack of visual prompts or tactile elements reduce accessibility and engagement."
              }
            ]
          ]
        }
      ]
    },
    {
      "title"      : "Design Development",
      "contents"   : [
        "Once we gathered insights from our site visit and initial research, we moved into design development. This phase involved structured ideation sessions, visual exploration, and iterative refinement of our concept to address user needs around navigation and engagement."
      ],
      "subsections": [
        {
          "title"   : "Ideation",
          "contents": [
            "After identifying key problems through our research and site visit, we began the ideation phase by first generating a broad range of ideas individually and as a team.",
            [
              {
                "header" : "Mind Mapping",
                "content": "We collaboratively mapped ideas related to navigation, exploration, and interactivity, helping us visualize how different features could serve user needs."
              },
              {
                "header" : "Brainwriting",
                "content": "Each team member independently generated quick ideas on paper, which were then passed around and built upon by others."
              },
              {
                "header" : "Prioritization Matrix",
                "content": "We plotted our top ideas on a 2x2 matrix, weighing user impact against design effort. This helped us narrow in on concepts that were both feasible and meaningful."
              }
            ]
          ],
          "images"  : [
            [
              {
                "image"  : "/images/case-study/telus/mind-mapping-2.webp",
                "caption": "This concept allows users to explore how Indigenous people lived in an igloo using AR and VR. Scanning QR codes reveals elements like a campfire and inventory. It’s designed to promote immersive, educational storytelling, especially for kids."
              },
              {
                "image"  : "/images/case-study/telus/mind-mapping-1.webp",
                "caption": "Markers labelled “Scan for Direction” provide real-time AR navigation. Scanning them displays arrows and text to guide users to nearby facilities, helping them navigate efficiently through the exhibit space."
              },
              {
                "image"  : "/images/case-study/telus/mind-mapping-6.webp",
                "caption": "A virtual assistant helps users navigate while encouraging them to collect digital items at each exhibit. This gamified journey supports both orientation and full exhibit engagement."
              }
            ],
            [
              {
                "image"              : "/images/case-study/telus/brainwriting-1.webp",
                "caption"            : "This concept allows users to explore how Indigenous people lived in an igloo using AR and VR. Scanning QR codes reveals elements like a campfire and inventory. It's designed to promote immersive, educational storytelling, especially for kids.",
                "containerPercentage": 90
              },
              {
                "image"              : "/images/case-study/telus/brainwriting-2.webp",
                "caption"            : "Markers labelled “Scan for Direction” provide real-time AR navigation. Scanning them displays arrows and text to guide users to nearby facilities, helping them navigate efficiently through the exhibit space.",
                "containerPercentage": 90
              },
              {
                "image"              : "/images/case-study/telus/brainwriting-3.webp",
                "caption"            : "A virtual assistant helps users navigate while encouraging them to collect digital items at each exhibit. This gamified journey supports both orientation and full exhibit engagement.",
                "containerPercentage": 90
              }
            ],
            [
              {
                "image"              : "/images/case-study/telus/matrix-1.webp",
                "caption"            : "A 2x2 prioritization matrix is used during an early brainstorming session to plot project ideas by impact (benefit to users) and effort (time, cost, skill). Each sticky note represents a distinct idea being considered.",
                "containerPercentage": 75
              },
              {
                "image"              : "/images/case-study/telus/matrix-2.webp",
                "caption"            : "The refined matrix reflects team consensus on high-value, achievable concepts. Notes at the bottom address user needs, the problem statement and what the product will be like.",
                "containerPercentage": 75
              }
            ]
          ]
        },
        {
          "title"   : "Personas",
          "contents": [
            "As part of our design process, we developed user personas to reflect common visitor types at science centre. The persona was formed based by our research and helped shape key elements of our app experience."
          ],
          "persona" : {
            "name"      : "Charlie Stewart",
            "image"     : "/images/case-study/telus/telus-persona.webp",
            "age"       : 13,
            "location"  : "Edmonton, Alberta",
            "devices"   : [],
            "type"      : "Student",
            "quote"     : "I want to create something that will amaze my classmates.",
            "goals"     : [
              "Learn more about the solar system to finish her science fair project on time",
              "Prove how much she's learned while visiting the science centre",
              "Show she is responsible enough to explore without her mom"
            ],
            "painPoints": [
              "Gets distracted easily",
              "Has parental locks on her phone",
              "Doesn’t like asking for help from strangers"
            ]
          }
        },
        {
          "title"   : "User Task Flows",
          "contents": [
            "We mapped out core user journeys such as scanning exhibits, collecting stamps, and navigating the science centre. These flows helped us understand branching decision points and ensure each interaction was logical and goal-driven before moving into wireframes."
          ],
          "images"  : [
            [
              {
                "image"              : "/images/case-study/telus/task-flow.webp",
                "caption"            : "A visual map of user task flows, outlining core interactions such as scanning exhibits, collecting stamps, and navigating through the science centre.",
                "containerPercentage": 50
              }
            ]
          ]
        },
        {
          "title"   : "Wireframes & Iterative Prototyping",
          "contents": [
            "Building on the task flows, we began wireframing to explore content layout, navigation structure, and interaction logic. Starting with low-fidelity sketches, we tested different layout options before transitioning into digital wireframes."
          ],
          "images"  : [
            [
              {
                "image"              : "/images/case-study/telus/wireframe-1.webp",
                "caption"            : "Early hand-drawn sketches that explored layout ideas, interface components, and user navigation flow. These rough drafts helped establish the overall structure before moving into digital design.",
                "containerPercentage": 75
              },
              {
                "image"  : "/images/case-study/telus/wireframe-2.webp",
                "caption": "Digital wireframes focused on refining layout, screen sequencing, and functional elements. These mockups helped test user flow and improve the visual hierarchy."
              }
            ]
          ]
        }
      ]
    },
    {
      "title"   : "Final Mockups",
      "contents": [
        "Our final mockups show the fleshed out app interface after several iterations, including stamp collection and navigation. The design balances educational prompts with intuitive navigation, offering diverse audiences a flexible and engaging experience."
      ],
      "images"  : [
        [
          {
            "image"              : "/images/case-study/telus/mockup-2.webp",
            "caption"            : "After onboarding, users land on the home screen to immediately access major features. This shows the transition from the home screen into the stamp book section, where users begin engaging with the core stamp-collecting experience.",
            "containerPercentage": 56
          }
        ],
        [
          {
            "image"              : "/images/case-study/telus/mockup-4.webp",
            "caption"            : "Screens in this row show how the stamp book is structured with multiple pages. Users can swipe through to review achievements and view newly earned badges as they collect more stamps, encouraging ongoing exploration and discovery.",
            "containerPercentage": 78
          }
        ],
        [
          {
            "image"  : "/images/case-study/telus/mockup-5.webp",
            "caption": "These screens demonstrate how users use the app’s AR functionality to scan real-world exhibit objects. Successfully scanning unlocks new stamps and content, integrating the digital experience with the physical environment."
          }
        ],
        [
          {
            "image"  : "/images/case-study/telus/mockup-7.webp",
            "caption": "Here, users explore the centre using a 3D map, browse the exhibit directory, and engage AR navigation features. This enhances wayfinding by combining visual-spatial understanding with digital guidance, making locating and reaching points of interest easier."
          }
        ]
      ]
    },
    {
      "title"      : "Usability Testing",
      "contents"   : [
        "We conducted pilot studies and on-site user tests at the Telus World of Science Edmonton to evaluate our prototype.",
        [
          {
            "header" : "Pilot Testing",
            "content": "We began with four informal tests using friends and family. This helped us refine the on-site testing interview and gather early feedback on clarity, usability, and design."
          },
          {
            "header" : "On-Site Testing",
            "content": "We conducted two contextual tests with real users at TWoSE. Participants explored exhibits using the app, giving insight into how they performed in their intended environment."
          }
        ]
      ],
      "images"     : [
        [
          {
            "image"  : "/images/case-study/telus/user-test-1.webp",
            "caption": "A participant uses the prototype app to explore a planetary exhibit, demonstrating how the interface interacts with real-world visuals during on-site testing."
          },
          {
            "image"  : "/images/case-study/telus/user-test-2.webp",
            "caption": "A close-up of the app interface shows how users engage with the quest list during their visit to the exhibit."
          }
        ]
      ],
      "subsections": [
        {
          "title"   : "Key Findings & Observations",
          "contents": [
            [
              {
                "header": "Users found the app easy to use, even without the tutorial"
              },
              {
                "header": "The interface felt intuitive and well-organized"
              },
              {
                "header": "Accessibility features (audio, contrast, map toggles) were appreciated"
              },
              {
                "header": "However, Some icons needed redesign for better clarity"
              }
            ],
            "Overall, the app worked well as a prototype, showing potential for real-world use. The feedback helped us refine visual hierarchy, accessibility, and interaction flow."
          ]
        }
      ]
    },
    {
      "title"   : "Project Reflection",
      "contents": [
        "Our project set out to improve how guests navigate and engage with the Telus World of Science and the stamp-based app prototype brought that vision to life.\n\nWe successfully met the learning objectives we set at the start of the project as:",
        [
          {
            "header": "Users were guided by stamp tasks that gave their visit direction and purpose"
          },
          {
            "header": "The app allowed users to explore at their own speed, revisit content, and track their progress over time"
          },
          {
            "header": "Interactive prompts and small rewards encouraged users to engage deeply with each exhibit"
          }
        ],
        "This project showed how thoughtful design can turn exploration into an engaging, educational, and personalized experience."
      ]
    }
  ]
}